SamakaCD/neuro-electronix/STM32/code/result/hi_stm32f103.c
#include "FreeRTOS.h"
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_exti.h"
#include "stm32f10x_adc.h"
#include "stm32f10x_usart.h"
#include "onewire_stm32f103.c"
#include "FreeRTOS.h"
#include "stdio.h"
#include "stdlib.h"
#include "semphr.h"
#include "string.h"
#include "misc.h"
#include "math.h"
#include "task.h"
#include "math.h"
#include <stdarg.h>
#include "heap_4.c"

#define Hi_List_Create(LIST, TYPE)					\
	struct LIST##_ItemStruct {						\
		TYPE 		Item; 							\
		uint32_t 	Index;							\
		struct LIST ## _ItemStruct Next;			\
	};												\
	typedef struct LIST##_ItemStruct LIST##_Item;	\
															\
	typedef struct {										\
		uint32_t	Count;									\
		LIST##_Item 	First;								\
		LIST##_Item 	Last;								\
	} LIST##_Def;										\
	LIST##_Def LIST;

#define Hi_List_Add(LIST, ITEM) 				\
	{											\
		(LIST ## _Item) _Item;					\
		_Item.Item = ITEM;						\
		_Item.Index = LIST.Count;				\
		_Item.Next = NULL;						\
												\
		if(LIST.Count == 0) {					\
			LIST.First = _Item;					\
			LIST.Last  = _Item;					\
		} else {								\
			LIST.Last.Next = (_Item);			\
			LIST.Last = _Item;					\
		}										\
		LIST.Count++;							\
	}

#define Hi_List_Get(LIST, IDX)					\
	{											\
		S_ITEM Item = LIST.First;				\
		uint32_t Index;							\
		if(Item == NULL) {						\
			return NULL;						\
		}										\
		do {									\
			Index = Item.Index;					\
			if(Item.Next == NULL) {				\
				return NULL;					\
			}									\
			Item = (Item.Next);					\
		} while(Index != IDX);					\
		return Item.Item;						\
	}


#define BUS_GPIOA RCC_APB2Periph_GPIOA
#define BUS_GPIOB RCC_APB2Periph_GPIOB
#define BUS_GPIOC RCC_APB2Periph_GPIOC
#define BUS_GPIOD RCC_APB2Periph_GPIOD
#define BUS_GPIOE RCC_APB2Periph_GPIOE
#define BUS_GPIOF RCC_APB2Periph_GPIOF
#define BUS_GPIOG RCC_APB2Periph_GPIOG

#define TIMER_DIVIDER 1000
#define ANTI_BOUNCE_TIME 100

#define RELAY_PORT GPIOA
#define RELAY_PIN GPIO_Pin_4
#define FE_TRANSISTOR_PORT GPIOB
#define FE_TRANSISTOR_PIN GPIO_Pin_13

#define TP_1_PORT GPIOB
#define TP_2_PORT GPIOC
#define TP_3_PORT GPIOC
#define TP_4_PORT GPIOA
#define TP_5_PORT GPIOA
#define TP_6_PORT GPIOA

#define TP_1_PIN GPIO_Pin_0
#define TP_2_PIN GPIO_Pin_5
#define TP_3_PIN GPIO_Pin_4
#define TP_4_PIN GPIO_Pin_7
#define TP_5_PIN GPIO_Pin_6
#define TP_6_PIN GPIO_Pin_5

#define UNB_A_PORT GPIOA
#define UNB_B_PORT GPIOA
#define UNB_A_PIN  GPIO_Pin_9
#define UNB_B_PIN  GPIO_Pin_10

#define ADC_CH_1 8
#define ADC_CH_2 15
#define ADC_CH_3 14
#define ADC_CH_4 7
#define ADC_CH_5 6
#define ADC_CH_6 5

#define SYSLED_PORT GPIOB
#define SYSLED_PIN  GPIO_Pin_5

#define WEAK __attribute__ ((weak))
#define MAX(A, B) ((A > B)?A:B)
#define MIN(A, B) ((A < B)?A:B)
#define _FPTR(RET, NAME, PARAM) RET (*NAME) (PARAM)

#define CreateTask(CODE, NAME, HANDLE) xTaskCreate(CODE, NAME, configMINIMAL_STACK_SIZE, NULL, 1, HANDLE)
#define CreateTask2(CODE) xTaskCreate(CODE, "", configMINIMAL_STACK_SIZE, NULL, 1, NULL)

#define FLASH_PAGE_SIZE  2048
#define FLASH_FIRST_ADDR 0x8014000 // Page 40
#define FLASH_PARTITION_PAGE 0x807D000 // Page 250

void Hi_UART_Send1(uint8_t data) {
	while(!(USART1 -> SR & USART_SR_TC));
	USART1 -> DR = data;
}

void Hi_UART_SendStr1(char* string) {
	uint8_t i=0;
	while(string[i]) {
		Hi_UART_Send1(string[i]);
		i++;
	}
}

void __println(char* pFormat, ...) {
	char* _mbuffer = (char*) pvPortMalloc(32);
    va_list ap;

    va_start(ap, pFormat);
    vsprintf(_mbuffer, pFormat, ap);
    va_end(ap);
    Hi_UART_SendStr1(_mbuffer);
    Hi_UART_SendStr1("\r\n");
    vPortFree(_mbuffer);
}

/* Conversion functions */
char* Hi_TrimZeros(char* target) {
	uint8_t i, len = strlen(target);

	for(i = len-1; i > 0; i--) {
		if((*(target + i)) == '0') {
			*(target + i) = 0;
		} else {
			return target;
		}
	}

	return target;
}

char* Hi_IntToStr(int i) {
	char* str = (char*) pvPortMalloc(16);
	sprintf(str, "%d", i);
	return str;
}

char* Hi_LongToStr(long l) {
	char* str = (char*) pvPortMalloc(32);
	sprintf(str, "%l", l);
	return str;
}

char* Hi_FloatToStr(float f) {
	char* str = (char*) pvPortMalloc(32);
	sprintf(str, "%f", f);
	return str;
}

char* Hi_DoubleToStr(double d) {
	char* str = (char*) pvPortMalloc(32);
	sprintf(str, "%g", d);
	return str;
}

int Hi_StrToInt(char* s) {
	if(strcmp(s, "") == 0) { return 0; }
	return atoi(s);
}

long Hi_StrToLong(char* s) {
	if(strcmp(s, "") == 0) { return 0; }
	return atol(s);
}

float Hi_StrToFloat(char* s) {
	if(strcmp(s, "") == 0) { return 0; }
	return atoff(s);
}

double Hi_StrToDouble(char* s) {
	if(strcmp(s, "") == 0) { return 0; }
	return atof(s);
}

char Hi_StrToChar(char* s) {
	if(strcmp(s, "") == 0) { return 0; }
	return s[0];
}

char* Hi_CharToStr(char c) {
	char* buf = (char*) pvPortMalloc(2);
	buf[0] = c;
	buf[1] = 0;
	return buf;
}

/* Strings */
char* Hi_Str_Concat(char* s1, char* s2) {
	char* buf = (char*) pvPortMalloc(strlen(s1) + strlen(s2) + 1);
	snprintf(buf, strlen(s1) + strlen(s2), "%s%s", s1, s2);
	return buf;
}

/* GPIO */
int Hi_GPIO_GetBus(GPIO_TypeDef* port) {
	if(port == GPIOA)
		return BUS_GPIOA;
	else if(port == GPIOB)
		return BUS_GPIOB;
	else if(port == GPIOC)
		return BUS_GPIOC;
	else if(port == GPIOD)
		return BUS_GPIOD;
	else if(port == GPIOE)
		return BUS_GPIOE;
	else if(port == GPIOF)
		return BUS_GPIOF;
	else if(port == GPIOG)
		return BUS_GPIOG;
	else return 0;
}

void Hi_GPIO_InitIn(GPIO_TypeDef* port, int pin) {
	RCC_APB2PeriphClockCmd(Hi_GPIO_GetBus(port), ENABLE);

	GPIO_InitTypeDef gpio;
	gpio.GPIO_Pin = pin;
	gpio.GPIO_Speed = GPIO_Speed_2MHz;
	gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(port, &gpio);
}

void Hi_GPIO_InitOut(GPIO_TypeDef* port, int pin, GPIOSpeed_TypeDef speed) {
	RCC_APB2PeriphClockCmd(Hi_GPIO_GetBus(port), ENABLE);

	GPIO_InitTypeDef gpio;
	gpio.GPIO_Pin = pin;
	gpio.GPIO_Speed = speed;
	gpio.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(port, &gpio);
}

char Hi_GPIO_ReadOutputDataBit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	uint8_t bitstatus = 0x00;
	if((GPIOx -> ODR & GPIO_Pin) != (uint32_t) Bit_RESET)
		bitstatus = (uint8_t) Bit_SET;
	else bitstatus = (uint8_t) Bit_RESET;
	return (char) bitstatus;
}

void Hi_GPIO_On(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	GPIOx->BSRR = GPIO_Pin;
}

