SamakaCD/neuro-electronix/STM32/code/result/hi_stm32f103.c
void Hi_GPIO_Off(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	GPIOx->BRR = GPIO_Pin;
}

void Hi_GPIO_Invert(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	GPIOx->ODR ^= GPIO_Pin;
}

/* === QUICK FUNCTIONS FOR DEBUG === */

#define Hi_QGPIO_Out(PORT, PIN) Hi_GPIO_InitOut(PORT, PIN, GPIO_Speed_2MHz)
#define HI_PORTON(PORT, PIN) Hi_GPIO_InitOut(PORT, PIN, GPIO_Speed_2MHz); Hi_GPIO_On(PORT, PIN);
#define Hi_QGPIO_Out2(PORT, PIN) HI_PORTON(PORT, PIN);

#define Hi_QGPIO_In(FUNC_NAME, FUNC, VAR_STATUS, PORT, PIN) \
uint8_t VAR_STATUS = 1; \
void FUNC_NAME(void* params) { \
	while(1) { \
		if(GPIO_ReadInputDataBit(PORT, PIN) != VAR_STATUS) { \
			VAR_STATUS = !VAR_STATUS; \
			FUNC(!VAR_STATUS); \
			vTaskDelay(ANTI_BOUNCE_TIME); \
		} \
	} \
}

#define Hi_QGPIO_In2(FUNC, PORT, PIN) Hi_QGPIO_In(__QGPIO_Func, FUNC, __QGPIO_Status, PORT, PIN)
#define Hi_QGPIO_In3(PORT, PIN) Hi_GPIO_InitIn(PORT, PIN); CreateTask(__QGPIO_Func, "__QGPIO_Func", NULL);
#define Hi_QResetF() \
void __QResetFunc(uint8_t status) { \
	if(status == 0) NVIC_SystemReset(); \
} \
Hi_QGPIO_In2(__QResetFunc, TP_1_PORT, TP_1_PIN);
#define Hi_QResetI() Hi_QGPIO_In3(TP_1_PORT, TP_1_PIN)

/* ================================= */

void Hi_ADC_Init(GPIO_TypeDef* port, int pin) {
	RCC_APB2PeriphClockCmd(Hi_GPIO_GetBus(port), ENABLE);

	GPIO_InitTypeDef gpio;
	gpio.GPIO_Pin = pin;
	gpio.GPIO_Speed = GPIO_Speed_2MHz;
	gpio.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_Init(port, &gpio);

	ADC_InitTypeDef  a;
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
	ADC_DeInit(ADC1);

	a.ADC_Mode = ADC_Mode_Independent;
	a.ADC_ScanConvMode = DISABLE;
	a.ADC_ContinuousConvMode = ENABLE;
	a.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	a.ADC_DataAlign = ADC_DataAlign_Right;
	a.ADC_NbrOfChannel = 6;

	ADC_Init(ADC1, &a);
	ADC_Cmd(ADC1, ENABLE);

	ADC_ResetCalibration(ADC1);
	while(ADC_GetResetCalibrationStatus(ADC1));
	ADC_StartCalibration(ADC1);
	while(ADC_GetCalibrationStatus(ADC1));
}

int Hi_ADC_Read(int channel) {
	  ADC_RegularChannelConfig(ADC1, channel, 1, ADC_SampleTime_1Cycles5);
	  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
	  while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
	  return ADC_GetConversionValue(ADC1);
}

/* UART */
#define Hi_UART_BufferSize 256
#define Hi_UART_ListenersCount 256

#define Hi_UART_Mode_W  0
#define Hi_UART_Mode_RW 1

#define Hi_UART1 0
#define Hi_UART2 1
#define Hi_UART3 2
#define Hi_UART4 3
#define Hi_UART5 4

typedef struct {
	_FPTR(void, *CharListeners, uint8_t);
	_FPTR(void, *EntListeners, uint8_t*);
	uint8_t CharListenersCount;
	uint8_t EntListenersCount;
	uint8_t  Initialised;
	uint8_t* Buffer;
	uint16_t BufferSize;
	uint16_t BufferCounter;
	uint8_t  Char;
	uint8_t Echo;
	USART_TypeDef* Def;
} Hi_UART_Struct;

Hi_UART_Struct Hi_UARTs[5];

void Hi_UART_Send(uint8_t uart, uint8_t data) {
	while(!(Hi_UARTs[uart].Def -> SR & USART_SR_TC)) { }
	Hi_UARTs[uart].Def -> DR = data;
}

void Hi_UART_SendStr(uint8_t uart, char* string) {
	taskENTER_CRITICAL();
	{
		uint8_t i = 0;
		while(string[i]) {
			__asm("NOP");
			__asm("NOP");
			__asm("NOP");
			Hi_UART_Send(uart, string[i]);
			__asm("NOP");
			__asm("NOP");
			__asm("NOP");
			i++;
		}
	}
	taskEXIT_CRITICAL();
}

void Hi_UART_ListenerInit(USART_TypeDef* UARTx, uint8_t UARTn) {
	if(UARTx -> SR & USART_SR_RXNE) {
		taskENTER_CRITICAL();
		{
			Hi_UART_Struct Uart = Hi_UARTs[UARTn];

			if(Uart.Echo) {
				UARTx -> DR = UARTx -> DR;
			}
			Uart.Char = UARTx -> DR;
			Uart.Buffer[Uart.BufferCounter++] = Uart.Char;

			uint8_t i;
			for(i = 0; i < Uart.CharListenersCount; i++) {
				Uart.CharListeners[i](Uart.Char);
			}

			if(Uart.Char == 'r') {
				Uart.Buffer[Uart.BufferCounter-1] = 0;
				for(i = 0; i < Uart.EntListenersCount; i++) {
					Uart.EntListeners[i](Uart.Buffer);
				}
				memset(Uart.Buffer, 0, Uart.BufferCounter);
				Uart.BufferCounter = 0;
			}
			Hi_UARTs[UARTn] = Uart;
		}
		taskEXIT_CRITICAL();
	}
	taskYIELD();
}

#define Hi_UART_InitPattern(__NAME, PORT, PINRX, PINTX, FUNCNAME) 	\
		Uart = Hi_UARTs[uart]; 										\
		if(!Uart.Initialised) {										\
			GPIO_InitStruct.GPIO_Pin = PINRX; 						\
			GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;			\
			GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP; 			\
			GPIO_Init(PORT, &GPIO_InitStruct); 						\
			 	 	 	 	 	 	 	 	 	 	 	 	 	 	\
			GPIO_InitStruct.GPIO_Pin = PINTX; 						\
			GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN_FLOATING; 		\
			GPIO_Init(PORT, &GPIO_InitStruct); 						\
			 	 	 	 	 	 	 	 	 	 	 	 	 	 	\
			USART_StructInit(&USART_InitStruct); 					\
			USART_InitStruct.USART_BaudRate = speed; 				\
			USART_InitStruct.USART_Mode = USART_Mode_Tx; 			\
			if(mode == Hi_UART_Mode_RW) { 							\
				USART_InitStruct.USART_Mode |= USART_Mode_Rx; 		\
			} 														\
			USART_Init(__NAME, &USART_InitStruct); 					\
			USART_Cmd(__NAME, ENABLE);								\
			CreateTask(FUNCNAME, "", NULL); 						\
			Uart.Buffer = (uint8_t*) pvPortMalloc(Hi_UART_BufferSize);	\
			Uart.CharListeners = pvPortMalloc(Hi_UART_ListenersCount); 	\
			Uart.EntListeners = pvPortMalloc(Hi_UART_ListenersCount); 	\
			Uart.BufferCounter = 0;										\
			Uart.BufferSize = Hi_UART_BufferSize;						\
			Uart.Echo = echo;											\
			Uart.Initialised = 1; 										\
			Uart.Def = __NAME;											\
			Hi_UARTs[uart] = Uart;										\
		}																\

void Hi_UART1_ListenerTask(void* params) {
	while(1) {
		Hi_UART_ListenerInit(USART1, Hi_UART1);
	}
}

void Hi_UART2_ListenerTask(void* params) {
	while(1) {
		Hi_UART_ListenerInit(USART2, Hi_UART2);
	}
}

void Hi_UART3_ListenerTask(void* params) {
	while(1) {
		Hi_UART_ListenerInit(USART3, Hi_UART3);
	}
}

void Hi_UART4_ListenerTask(void* params) {
	while(1) {
		Hi_UART_ListenerInit(UART4, Hi_UART4);
	}
}

void Hi_UART5_ListenerTask(void* params) {
	while(1) {
		Hi_UART_ListenerInit(UART5, Hi_UART5);
	}
}

void Hi_UART_Init(uint8_t uart, uint8_t mode, uint8_t echo, uint32_t speed) {
	GPIO_InitTypeDef GPIO_InitStruct;
	USART_InitTypeDef USART_InitStruct;
	Hi_UART_Struct Uart;

	switch(uart) {
		case Hi_UART1:
			RCC_APB2PeriphClockCmd((RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO), ENABLE);
			Hi_UART_InitPattern(USART1, GPIOA, GPIO_Pin_9, GPIO_Pin_10, Hi_UART1_ListenerTask);
			break;
		case Hi_UART2:
			RCC_APB2PeriphClockCmd((RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO), ENABLE);
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
			Hi_UART_InitPattern(USART2, GPIOA, GPIO_Pin_2, GPIO_Pin_3, Hi_UART2_ListenerTask);
			break;
		case Hi_UART3:
			RCC_APB2PeriphClockCmd((RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO), ENABLE);
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
			Hi_UART_InitPattern(USART3, GPIOB, GPIO_Pin_10, GPIO_Pin_11, Hi_UART3_ListenerTask);
			break;
		case Hi_UART4:
			RCC_APB2PeriphClockCmd((RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO), ENABLE);
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
			Hi_UART_InitPattern(UART4, GPIOC, GPIO_Pin_10, GPIO_Pin_11, Hi_UART4_ListenerTask);
			break;
		case Hi_UART5:
			RCC_APB2PeriphClockCmd((RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO), ENABLE);
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);
			Hi_UART_InitPattern(UART5, GPIOC, GPIO_Pin_12, GPIO_Pin_12, Hi_UART5_ListenerTask);
			break;
	}
}

void Hi_UART_AddListener(uint8_t uart, _FPTR(void, listener, uint8_t)) {
	Hi_UART_Struct Uart = Hi_UARTs[uart];
	Uart.CharListeners[Uart.CharListenersCount++] = listener;
	Hi_UARTs[uart] = Uart;
}

void Hi_UART_AddEntListener(uint8_t uart, _FPTR(void, listener, uint8_t*)) {
	Hi_UART_Struct Uart = Hi_UARTs[uart];
	Uart.EntListeners[Uart.EntListenersCount++] = listener;
	Hi_UARTs[uart] = Uart;
}

