SamakaCD/neuro-electronix/STM32/code/result/hi_stm32f103.c
int Hi_NumberLen(int n) {
	int o, res = 0;
	o = n;
	if(n < 0) {
		n = abs(n);
		res++;
	}

	while(n > 0) {
		n /= 10;
		res++;
	}
	return res;
}

double iitod(int a, int b) {
	return a + b * (pow(10, -Hi_NumberLen(b)));
}

/* DS18B20 */
#include "ds18b20_stm32f103.c"
void Hi_DS18B20_Scan(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, _FPTR(void, ErrorHandler, uint8_t), _FPTR(void, ResultHandler, double)) {
	unsigned char Hi_DS18B20_SN[One_Wire_Device_Number_MAX][DS1822_SERIAL_NUM_SIZE];
	unsigned int Hi_DS18B20_Temps[One_Wire_Device_Number_MAX];
	uint8_t Hi_DS18B20_Status = One_Wire_Success;
	uint8_t Hi_DS18B20_Count = 0;

    taskENTER_CRITICAL();
    {
		// Reset
		Hi_DS18B20_Status = One_Wire_Reset(GPIOx, GPIO_Pin);
    }
    taskEXIT_CRITICAL();
	ErrorHandler(Hi_DS18B20_Status);

    taskENTER_CRITICAL();
    {
    	// Scan
    	Hi_DS18B20_Status = DS1822_Search_Rom2(GPIOx, GPIO_Pin, &Hi_DS18B20_Count, &Hi_DS18B20_SN);
    }
    taskEXIT_CRITICAL();
	ErrorHandler(Hi_DS18B20_Status);

    taskENTER_CRITICAL();
    {
    	// Conversion
    	int i;
    	for(i = 0; i < Hi_DS18B20_Count; i++) {
    		Hi_DS18B20_Status = DS1822_Start_Conversion_by_ROM(GPIOx, GPIO_Pin, &(Hi_DS18B20_SN[i]));
    	}
    }
    taskEXIT_CRITICAL();
	ErrorHandler(Hi_DS18B20_Status);

	//Wait 750ms for conversion ready
	vTaskDelay(750);

    taskENTER_CRITICAL();
    {
		// Getting results
		int i;
		for(i = 0; i < Hi_DS18B20_Count; i++) {
			Hi_DS18B20_Status = DS1822_Get_Conversion_Result_by_ROM_CRC(GPIOx, GPIO_Pin, &Hi_DS18B20_SN[i], &Hi_DS18B20_Temps[i]);
		}
    }
	ErrorHandler(Hi_DS18B20_Status);
    taskEXIT_CRITICAL();

    int i;
	for(i = 0; i < Hi_DS18B20_Count; i++) {
		ResultHandler(iitod((Hi_DS18B20_Temps[i] >> 4), (Hi_DS18B20_Temps[i] & 0x0F)));
	}
}

void __print(char* pFormat, ...) {
	char* _mbuffer = (char*) pvPortMalloc(256);
    va_list ap;

    va_start(ap, pFormat);
    vsprintf(_mbuffer, pFormat, ap);
    va_end(ap);
    Hi_UART_SendStr1(_mbuffer);
    vPortFree(_mbuffer);
}

void Hi_CharToHex(char c, char* buf) {
	static char hex_symbols[] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };
	uint8_t i = 1;

	do {
		*(buf + i) = hex_symbols[(c % 16)];
		c /= 16;
		i--;
	} while(c != 0);

	if(i == 0) {
		*buf = '0';
	}
}

void Hi_IntToBin(uint8_t c, char* buf) {
	static char symbols[] = { '0', '1' };
	uint8_t i = 1;

	do {
		*(buf + i) = symbols[(c % 2)];
		c /= 2;
		i--;
	} while(c != 0);

	if(i == 0) {
		*buf = '0';
	}
}

/* iButton */
void Hi_iButton_Read(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, char* buffer, int* pToggle, uint8_t type) {
	uint8_t i;
	char* b = pvPortMalloc(8);
	char* hex = pvPortMalloc(2);

    taskENTER_CRITICAL();
    {
    	Hi_GPIO_InitOut(GPIOx, GPIO_Pin, GPIO_Speed_50MHz);
    	Hi_GPIO_On(GPIOx, GPIO_Pin);
    	if(One_Wire_Reset(GPIOx, GPIO_Pin) == 0) {
    		(*pToggle)++;
        	One_Wire_Write_Byte(0x33, GPIOx, GPIO_Pin);
        	for(i = 0; i < 8; i++) {
        		b[i] = One_Wire_Read_Byte(GPIOx, GPIO_Pin);
        	}
    	} else {
    		*pToggle = 0;
    	}
    }
    taskEXIT_CRITICAL();

    if(*pToggle == 1) {
        if(type) {
        	for(i = 0; i < 8; i++) {
        		*(buffer+i) = *(b+i);
        	}
        	*(buffer+8) = 0;
        } else {
        	for(i = 0; i < 16; i += 2) {
        		Hi_CharToHex(*(b+i/2), hex);
        		*(buffer+i) = hex[0];
        		*(buffer+i+1) = hex[1];
        	}
        	*(buffer+16) = 0;
        }
    }

    vPortFree(b);
    vPortFree(hex);
}

/* RTC (Temporaty implementation) */

uint32_t Hi_RTC_TimeCnt = 0;
void vHi_RTC_Task(void* params) {
	while(1) {
		if(++Hi_RTC_TimeCnt >= 86400) {
			Hi_RTC_TimeCnt = 0;
		}
		vTaskDelay(1000);
	}
}

uint8_t Hi_RTC_Initialised;
void Hi_RTC_Init() {
	if(!Hi_RTC_Initialised) {
		Hi_RTC_Initialised = 1;
		xTaskCreate(vHi_RTC_Task, "vHi_RTC_Task", configMINIMAL_STACK_SIZE, NULL, 1, NULL);
	}
}

void Hi_RTC_SetTime(uint8_t hour, uint8_t min, uint8_t sec) {
	if(hour < 24 && min < 60 && sec < 60) {
		Hi_RTC_TimeCnt = 3600 * hour + 60 * min + sec;
	}
}

uint8_t Hi_RTC_GetHour() {
	return Hi_RTC_TimeCnt / 3600;
}

uint8_t Hi_RTC_GetMin() {
	return (Hi_RTC_TimeCnt % 3600) / 60;
}

uint8_t Hi_RTC_GetSec() {
	return (Hi_RTC_TimeCnt % 3600) % 60;
}

/* Logger */

char* Hi_Logger_Print(int id, char* key, char* buffer, int* last_record_pos, uint8_t clear) {
	char* buf = pvPortMalloc(56);
	uint16_t len = sprintf(buf, "%d\t%d:%d:%d\t%s\r\n", id, Hi_RTC_GetHour(), Hi_RTC_GetMin(), Hi_RTC_GetSec(), key);

	uint16_t i;
	for(i = 0; i < len; i++) {
		*(buffer + *last_record_pos + i) = *(buf + i);
	}

	*(last_record_pos) += len;
	if(clear) {
		vPortFree(buf);
	}

	return buf;
}

/* Flash */
#include "flash_stm32f103.c"

void Hi_Flash_DumpProtocolPage(uint32_t address, char* buffer, uint16_t* dataSize) {
	uint16_t i, size = Hi_Flash_Read16(address);
	if(dataSize != NULL) {
		*(dataSize) = size;
	}
	address += 2;
	for(i = 0; i < size; i++) {
		*(buffer + i) = Hi_Flash_Read1(address + i);
		if(i != size) {
			*(buffer + i + 1) = Hi_Flash_Read2(address + i);
			i++;
		}
	}
}

void Hi_Flash_WriteData(uint32_t address, char* data) {
	Hi_Flash_Unlock();
	Hi_Flash_ErasePage(address);
	Hi_Flash_StartRecord();

	Hi_Flash_Write16(address, strlen(data));
	address += 2;
	int i;
	for(i = 0; i < strlen(data); i++) {
		if(i != strlen(data)-1) {
			Hi_Flash_Write((address + i), *(data + i), *(data + i + 1));
			i++;
		} else {
			Hi_Flash_Write((address + i), *(data + i), 0xFF);
		}
	}

	Hi_Flash_EndRecord();
	Hi_Flash_Lock();
}

#define Hi_QFlash_Start(PADDR) Hi_Flash_Unlock(); Hi_Flash_ErasePage(PADDR); Hi_Flash_StartRecord();
#define Hi_QFlash_Stop() Hi_Flash_EndRecord(); Hi_Flash_Lock();

void Hi_Flash_AddData(uint32_t address, char* data) {
	uint16_t i, size = Hi_Flash_Read16(address);

	if(size == 0xFFFF) {
		Hi_Flash_WriteData(address, data);
	} else {
		char* buffer = pvPortMalloc(FLASH_PAGE_SIZE);
		Hi_Flash_DumpProtocolPage(address, buffer, NULL);

		for(i = 0; i < size + strlen(data); i++) {
			*(buffer + size + i) = *(data + i);
		}

		Hi_Flash_Unlock();
		Hi_Flash_ErasePage(address);
		Hi_Flash_StartRecord();

		Hi_Flash_Write16(address, strlen(buffer));
		address += 2;
		for(i = 0; i < strlen(buffer); i++) {
			if(i != strlen(buffer)-1) {
				Hi_Flash_Write((address + i), *(buffer + i), *(buffer + i + 1));
				i++;
			} else {
				Hi_Flash_Write((address + i), *(data + i), 0xFF);
			}
		}

		Hi_Flash_EndRecord();
		Hi_Flash_Lock();
		vPortFree(buffer);
	}
}

void Hi_Flash_WriteData2(uint32_t address, char* data, uint16_t lenght) {
	taskENTER_CRITICAL(); {
		Hi_Flash_Unlock();
		Hi_Flash_ErasePage(address);
		Hi_Flash_StartRecord();
		Hi_Flash_Write16(address, lenght);
		address += 2;
		int i;
		for(i = 0; i < lenght; i++) {
			if(i != lenght-1) {
				Hi_Flash_Write((address + i), *(data + i), *(data + i + 1));
				i++;
			} else {
				Hi_Flash_Write((address + i), *(data + i), 0xFF);
			}
		}

		Hi_Flash_EndRecord();
		Hi_Flash_Lock();
	} taskEXIT_CRITICAL();
}

