SamakaCD/neuro-electronix/STM32/code/result/hi_stm32f103.c
void Hi_Flash_AddData2(uint32_t address, char* data, uint16_t leght) {
	uint16_t i, size = Hi_Flash_Read16(address);
	if(size == 0xFFFF) {
		Hi_Flash_WriteData2(address, data, leght);
	} else {
		char* buffer = pvPortMalloc(FLASH_PAGE_SIZE);
		Hi_Flash_DumpProtocolPage(address, buffer, NULL);

		for(i = 0; i < size + leght; i++) {
			*(buffer + size + i) = *(data + i);
		}

		taskENTER_CRITICAL(); {
			Hi_Flash_Unlock();
			Hi_Flash_ErasePage(address);
			Hi_Flash_StartRecord();

			Hi_Flash_Write16(address, size + leght);
			address += 2;
			for(i = 0; i < size + leght; i++) {
				if(i != size + leght-1) {
					Hi_Flash_Write((address + i), *(buffer + i), *(buffer + i + 1));
					i++;
				} else {
					Hi_Flash_Write((address + i), *(data + i), 0xFF);
				}
			}

			Hi_Flash_EndRecord();
			Hi_Flash_Lock();
		} taskEXIT_CRITICAL();
		vPortFree(buffer);
	}
}

// Partition page: [L][L]..........[\0]..........[\0]
void Hi_Flash_CreatePartition(char* name) {
	uint8_t j, hasSuchPartition = 0;
	uint16_t i, dataSize = Hi_Flash_Read16(FLASH_PARTITION_PAGE);
	if(dataSize == 0xFFFF) { // We are first here
		Hi_Flash_AddData2(FLASH_PARTITION_PAGE, name, strlen(name)+1);
	} else {
		char* dump = (char*) pvPortMalloc(dataSize);
		char* str = (char*) pvPortMalloc(32);
		Hi_Flash_DumpProtocolPage(FLASH_PARTITION_PAGE, dump, NULL);
		for(i = 0; i < dataSize; i++) {
			if(dump[i]) {
				str[i] = dump[i];
			} else {
				hasSuchPartition = (strcmp(str, name) == 0);
				for(j = 0; j < 32; j++) str[j] = 0;
				break;
			}
		}
		if(!hasSuchPartition)
			Hi_Flash_AddData2(FLASH_PARTITION_PAGE, name, strlen(name)+1);
		vPortFree(dump);
		vPortFree(str);
	}
}



void Hi_Flash_Print(uint32_t address, uint8_t count) {
	uint8_t i, j, c;
	Hi_UART_SendStr1("0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F\r\n-----------------------------------------------\r\n");
	for(i = 0; i < count; i += 2) {
		__print("%02X %02X ", Hi_Flash_Read1(address + i), Hi_Flash_Read1(address + i + 1));

		if(((i+2) % 16) == 0) {
			__print("\t");
			for(j = 0; j < 16; j++) {
				c = Hi_Flash_Read1(address + j + i - 14);
				Hi_UART_Send1(( (c >= 32) && (c <= 127) ) ? c : '.');
			}
			__print("\r\n");
		}
	}
}

/* NeuroProto */

#define Hi_Proto_PacketType_Std 0b00000000
#define Hi_Proto_PacketType_1   0b01000000
#define Hi_Proto_PacketType_2   0b10000000
#define Hi_Proto_PacketType_3   0b11000000

uint8_t Hi_Proto_Crc8(char* pcBlock, uint8_t len) {
	uint8_t i, j, byte, crc = 0;
	for(i = 0; i < len; i++) {
		byte = pcBlock[i];
		for(j = 0; j < 8; j++) {
			if((byte ^ crc) & 1)
				crc = ((crc ^ 24) >> 1) | 128;
			else crc >>= 1;
			byte >>= 1;
		}
	}
	return crc;
}

uint8_t Hi_Proto_CheckCRC(char* pcBlock, uint8_t len, uint8_t crc) {
	return Hi_Proto_Crc8(pcBlock, len) == crc;
}

uint8_t Hi_Proto_CreateDesriptior(uint8_t packetType, uint8_t markerSize, uint8_t size) {
	return packetType | (markerSize << 4) | MIN(size, 15);
}

uint8_t Hi_Proto_GetDescriptorPacketType(uint8_t descriptor) {
	switch(descriptor >> 6) {
		case 1: return Hi_Proto_PacketType_1;
		case 2: return Hi_Proto_PacketType_2;
		case 3: return Hi_Proto_PacketType_3;
		default: return Hi_Proto_PacketType_Std;
	}
}

uint8_t Hi_Proto_GetDescriptorMarkerSize(uint8_t descriptor) {
	return (descriptor & 48) >> 8;
}

uint8_t Hi_Proto_GetDescriptorDataSize(uint8_t descriptor) {
	return (descriptor & 0b00001111);
}

uint8_t Hi_Proto_MarkerSize(uint32_t marker) {
	if(marker == 0)
		return 0;
	else if(marker <= 0xFF)
		return 1;
	else if(marker <= 0xFFFF)
		return 2;
	else return 3;
}

uint8_t* Hi_Proto_CreateMarkerArr(uint32_t marker) {
	uint8_t i, msz = Hi_Proto_MarkerSize(marker);
	uint8_t* m = (uint8_t*) pvPortMalloc(msz);

	for(i = 1; i <= msz; i++) {
		m[msz - i] = (marker & 0xFF);
		marker >>= 8;
	}
	return m;
}

char* Hi_Proto_CreatePack(uint8_t packetType, uint32_t markerInt, char* data, uint8_t dataSize, uint8_t* sz) {
	uint8_t i, markerSize = Hi_Proto_MarkerSize(markerInt);
	char* packetBuf = (char*) pvPortMalloc(markerSize + dataSize + 2);
	uint8_t* marker = Hi_Proto_CreateMarkerArr(markerInt);
	*(packetBuf) = Hi_Proto_CreateDesriptior(packetType, markerSize, dataSize);

	for(i = 0; i < markerSize; i++) {
		*(packetBuf + i + 1) = *(marker + i);
	}

	for(i = 0; i < dataSize; i++) {
		*(packetBuf + markerSize + i + 1) = *(data + i);
	}

	*(packetBuf + markerSize + dataSize + 1) = Hi_Proto_Crc8(packetBuf, (markerSize + dataSize + 1));
	if(sz != 0) {
		*sz = markerSize + dataSize + 2;
	}
	return packetBuf;
}

#define Hi_Proto_BufferMax 21
char* Hi_Proto_Buffer;
uint8_t Hi_Proto_BufferPos = 0;

void Hi_Proto_AllocateBuffer() {
	Hi_Proto_Buffer = (char*) pvPortMalloc(Hi_Proto_BufferMax);
}

void Hi_Proto_WriteBuffer(char c) {
	Hi_Proto_Buffer[Hi_Proto_BufferPos++] = c;
}

void Hi_Proto_ClearBuffer() {
	vPortFree(Hi_Proto_Buffer);
	Hi_Proto_BufferPos = 0;
}

/* ConnectionManager */

#define Hi_CM_ListenersMax 32
#define Hi_CM_NONE -1
#define Hi_CM_UART  0
#define Hi_CM_HID   1
#define Hi_CM_CAN   2
#define Hi_CM_GSM   3
#define Hi_CM_UART_Timeout 100
#define Hi_CM_ResponseOK 200

typedef struct {
	uint8_t  PacketType;
	uint8_t  MarkerSize;
	uint8_t  DataSize;
	uint32_t Marker;
	char*    Data;
} CM_Result;

uint8_t Hi_CM_IsPacketTransition = 0;
uint8_t Hi_CM_ReceivedCount      = 0;
uint8_t Hi_CM_PacketSize         = 0;
uint8_t Hi_CM_ListenersPos = 0;
volatile uint8_t Hi_CM_WaitingOnUART = 0;
_FPTR(void, *Hi_CM_Listeners, CM_Result);
CM_Result Hi_CM_Result;
xSemaphoreHandle Hi_CM_UARTSemaphore;

void Hi_CM_UARTConnectionListener(uint8_t c) {
	if(Hi_CM_IsPacketTransition) {
		if(Hi_CM_ReceivedCount < (Hi_CM_PacketSize-1)) { // Transition process
			Hi_Proto_WriteBuffer(c);
		} else { // End of transition
			Hi_Proto_WriteBuffer(c); // CRC
			uint8_t i;
			for(i = 1; i < Hi_CM_Result.MarkerSize; i++)
				Hi_CM_Result.Marker = (Hi_CM_Result.Marker << 8) | Hi_Proto_Buffer[i];

			char* data = (char*) pvPortMalloc(Hi_CM_Result.DataSize);
			for(i = 0; i < Hi_CM_Result.DataSize; i++)
				data[i] = Hi_Proto_Buffer[i + Hi_CM_Result.MarkerSize + 1];
			Hi_CM_Result.Data = data;

			if(Hi_Proto_CheckCRC(Hi_Proto_Buffer, Hi_CM_Result.MarkerSize + Hi_CM_Result.DataSize + 1, c))
				for(i = 0; i < Hi_CM_ListenersPos; i++)
					(*(Hi_CM_Listeners + i))(Hi_CM_Result);

			Hi_CM_IsPacketTransition = 0;
			Hi_CM_ReceivedCount      = 0;
			Hi_CM_PacketSize         = 0;
		}
	} else { // Start of transition
		Hi_CM_IsPacketTransition = 1;
		Hi_CM_ReceivedCount = 1;
		Hi_Proto_ClearBuffer();
		Hi_Proto_AllocateBuffer();
		Hi_Proto_WriteBuffer(c);
		Hi_CM_Result.PacketType = Hi_Proto_GetDescriptorPacketType(c);
		Hi_CM_Result.MarkerSize = Hi_Proto_GetDescriptorMarkerSize(c);
		Hi_CM_Result.DataSize = Hi_Proto_GetDescriptorDataSize(c);
		Hi_CM_PacketSize = Hi_CM_Result.MarkerSize + Hi_CM_Result.DataSize + 2;
	}
}

