SamakaCD/neuro-electronix/STM32/code/result/hi_stm32f103.c
void Hi_CM_UARTListener(uint8_t in) {
	if(Hi_CM_WaitingOnUART && in == Hi_CM_ResponseOK) {
		Hi_CM_WaitingOnUART = 0;
		xSemaphoreGive(Hi_CM_UARTSemaphore);
	}
}

void Hi_CM_AddListener(_FPTR(void, listener, CM_Result)) {
	Hi_CM_Listeners[Hi_CM_ListenersPos++] = listener;
}

void Hi_CM_Init() {
	Hi_UART_AddListener(Hi_UART1, Hi_CM_UARTConnectionListener);
	Hi_UART_AddListener(Hi_UART1, Hi_CM_UARTListener);
	Hi_CM_Listeners = pvPortMalloc(Hi_CM_ListenersMax * sizeof(Hi_CM_Listeners));
	vSemaphoreCreateBinary(Hi_CM_UARTSemaphore);
	xSemaphoreTake(Hi_CM_UARTSemaphore, 1);
}

uint8_t Hi_CM_IsUARTActive() {
	Hi_UART_SendStr1("CHECK_UART");
	Hi_CM_WaitingOnUART = 1;
	if(xSemaphoreTake(Hi_CM_UARTSemaphore, Hi_CM_UART_Timeout)) {
		return 1;
	} else {
		return 0;
	}
}

uint8_t Hi_CM_GetConnection() {
	return Hi_CM_UART;
}

void Hi_CM_SendDataByConnection(char* data, uint8_t connection, uint8_t len) {
	switch(connection) {
		case Hi_CM_UART: {
			uint8_t i;
			for(i = 0; i < len; i++)
				Hi_UART_Send1(data[i]);
			break;
		}
	}
}

void Hi_CM_SendData(char* data, uint8_t len) {
	Hi_CM_SendDataByConnection(data, Hi_CM_GetConnection(), len);
}

/* SharedMemory */

uint16_t* Hi_SM_Markers;

void Hi_SM_Init() {
	Hi_SM_Markers = pvPortMalloc(256);
}

void Hi_SM_Create(uint32_t address, uint16_t len, uint16_t marker) {

}

uint32_t Hi_Logger_LastTime = 0;
uint8_t* Hi_Logger_CreatePack(uint16_t address) {
	uint8_t* pack = (uint8_t*) pvPortMalloc(4);
	uint16_t timeDelta = Hi_RTC_TimeCnt - Hi_Logger_LastTime;
	pack[0] = (address >> 4) & 0xFF;
	pack[1] = address & 0xFF;
	pack[2] = (timeDelta >> 4) & 0xFF;
	pack[3] = timeDelta & 0xFF;
	return pack;
}

uint8_t Hi_Logger_LastTimeAvilable = 0;
void Hi_Logger_Notify(uint16_t address, uint32_t marker) {
	Hi_RTC_Init();
	uint8_t* pack = Hi_Logger_CreatePack(address);
	uint8_t isUARTAvilable = Hi_CM_IsUARTActive();
	if(isUARTAvilable) {
		Hi_UART_SendStr1((char*) pack);
		Hi_Logger_LastTime = Hi_RTC_TimeCnt;
		Hi_Logger_LastTimeAvilable = 1;
	} else { // UART is not avilable. Let's write to flash

		Hi_Logger_LastTimeAvilable = 0;
	}
	vPortFree(pack);
}
